using System.Collections.Generic;
using Microsoft.AspNetCore.Mvc;
using MVC_Card.Models;

namespace MVC_Card.ViewComponents
{
    public class LastestArticlesViewComponent : ViewComponent
    {
        List<Article> _lastestArticles = new List<Article>()
        {
            new Article(1, "بررسی تفاوت JSON و XML", "blog-post-thumb-1.jpg",
                "در این مقاله قصد داریم تفاوت ها و شباهت های دو زبان جذاب و دوستداشتنی را خدمتتان عرض نمائیم.در ابتدا توضیح جزئی " +
                "از هرکدام ارائه میشود سپس به تفاوت ها و شباهت ها و در نهایت مکانی که باید ازچند مثال ساده و " +
                "اینکه بهتر است از کدامیک در چه پروژه هایی استفاده شود صحبت میکنیم پس با ما همراه باشید",
                "#"),
            new Article(2, "آموزش استفاده از View Component", "blog-post-thumb-2.jpg",
                "در این مقاله قصد داریم نحوه استفاده از ViewComponent را به شما یاد بدهیم و بگوییم که بهتر است در کجا استفاده شود و " +
                "در نهایت با چند مثال ساده و کاربردی بحث به پایان میرسد-خواهشمند است با ها همراه باشید",
                "#"),
            new Article(3, "آموزش نرمال سازی پایگاه داده", "blog-post-thumb-3.jpg",
               "در این مقاله قصد داریم چگونگی بهینه سازی یک پایگاه داده را به شما اموزش دهیم یا به اصلاح نرمال سازی-ابتدا یک مثال ساده بدون نرمال بودن پایگاه داده سپس با بهینه بودن ان انجام میدهیم" +
               "در مرحله بعد انواع مختلف سطوح نرمال را توضیح داده و از هرکدام مثالی ارائه میشود" +
               "سپس چند مثال کاربردی دیگر را باهم انجام میدهیم پس با من همراه باشید",
                "#"),
            new Article(4, "کار با EFcore", "blog-post-thumb-4.jpg",
                "در این مقاله قصد داریم تا با یکی از مباحث .net همراه شما باشیم.درابتدا شروع به معرفی Efcore وتفاوت آن با نسخه های قبلی سپس اموزش کاربرد های آن و در نهایت چند مثال باهم انجام میدهیم." +
                "پس با من همراه باشید",
                "#"),
        };


        public IViewComponentResult Invoke()
        {
            return View("_lastestArticles",_lastestArticles);
        }
    }
}